Revit 2027 API
PathOfTravel.GetWaypoints Method
 return the waypoints set for the Path of Travel
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<XYZ> GetWaypoints()
Public Function GetWaypoints As IList(Of XYZ)
public:
IList<XYZ^>^ GetWaypoints()
member GetWaypoints : unit -> IList<XYZ>
Return Value
IList<XYZ>
See Also
Reference
PathOfTravel Class
Autodesk.Revit.DB.Analysis Namespace